#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

Show Plan for dev

```terraform
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_cloudwatch_log_group.flow_logs[0]: Refreshing state... [id=/aws/vpc/dev-flow-logs]
module.vpc.aws_iam_role.flow_logs_role[0]: Refreshing state... [id=dev-vpc-flow-logs-role]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0d1708eadb32a47ff]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_iam_role_policy.flow_logs_policy[0]: Refreshing state... [id=dev-vpc-flow-logs-role:dev-vpc-flow-logs-policy]
module.vpc.aws_iam_role_policy.flow_logs_policy_1[0]: Refreshing state... [id=dev-vpc-flow-logs-role:dev-vpc-flow-logs-policy]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-01ab54e5c70e60853]
module.vpc.aws_flow_log.main[0]: Refreshing state... [id=fl-04fb87441860069ba]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-02193d8e28e77be3d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-039e770d58e472805]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08869537e813e2700]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0be1d4aa307670243]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f7d19ec208623894]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0138a3c9df05392a1]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0bdd62e527aeb6e2e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0724b81770cec3d35]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-05a9e66c2e47a5524]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0c21ba33b6f2013e0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-015b5221cffd6130a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0906641c6c2cc1686]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-091ca5267f6ed7e50]
module.vpc.aws_nat_gateway.main[0]: Refreshing state... [id=nat-0700eb426c6b505e0]
module.vpc.aws_nat_gateway.main[2]: Refreshing state... [id=nat-0cfbad817f4069bc4]
module.vpc.aws_nat_gateway.main[1]: Refreshing state... [id=nat-00efb69a074cc98d4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-029b2226e6fa74d32]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-012e1900cd0ee559a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0927c1fdf50293e81]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-088c3b6642a1eceea]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0fa0c908000da830b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05e8b2f2599b5b946]
module.eks.aws_kms_key.eks: Refreshing state... [id=c3c34ebd-7624-466e-8f4c-0d6fb097c182]
module.eks.aws_iam_role.cluster: Refreshing state... [id=dev-myapp-eks-cluster-role]
module.eks.aws_cloudwatch_log_group.cluster: Refreshing state... [id=/aws/eks/dev-myapp-eks/cluster]
module.eks.aws_security_group.cluster: Refreshing state... [id=sg-0c929ac4c30329b39]
module.eks.aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::274601145879:policy/dev-myapp-eks-cluster-autoscaler-policy]
module.eks.data.http.aws_load_balancer_controller_policy: Reading...
module.eks.aws_security_group_rule.cluster_egress: Refreshing state... [id=sgrule-663039278]
module.eks.aws_security_group_rule.cluster_ingress_workstation_https: Refreshing state... [id=sgrule-3637193147]
module.eks.data.http.aws_load_balancer_controller_policy: Read complete after 0s [id=https://raw.githubusercontent.com/kubernetes-sigs/aws-load-balancer-controller/v2.6.0/docs/install/iam_policy.json]
module.eks.aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::274601145879:policy/dev-myapp-eks-aws-load-balancer-controller-policy]
module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=dev-myapp-eks-cluster-role-2025102510541462600000000a]
module.eks.aws_iam_role_policy_attachment.vpc_resource_controller: Refreshing state... [id=dev-myapp-eks-cluster-role-20251025105414624800000009]
module.eks.aws_kms_alias.eks: Refreshing state... [id=alias/dev-myapp-eks-eks]
module.eks.aws_eks_cluster.main: Refreshing state... [id=dev-myapp-eks]
module.eks.aws_eks_addon.vpc_cni: Refreshing state... [id=dev-myapp-eks:vpc-cni]
module.eks.data.tls_certificate.cluster: Reading...
data.aws_eks_cluster.cluster: Reading...
module.eks.aws_eks_addon.kube_proxy: Refreshing state... [id=dev-myapp-eks:kube-proxy]
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=dev-myapp-eks]
data.aws_eks_cluster.cluster: Read complete after 0s [id=dev-myapp-eks]
module.eks.data.tls_certificate.cluster: Read complete after 0s [id=0c37bb608751c2a14704338d4b14c14e6dbe88ac]
module.eks.aws_iam_openid_connect_provider.cluster: Refreshing state... [id=arn:aws:iam::274601145879:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/05D164A682CCFFFA27F707AAE96B78D2]
module.eks.data.aws_iam_policy_document.aws_load_balancer_controller_assume: Reading...
module.eks.data.aws_iam_policy_document.cluster_autoscaler_assume: Reading...
module.eks.data.aws_iam_policy_document.ebs_csi_driver_assume: Reading...
module.eks.data.aws_iam_policy_document.aws_load_balancer_controller_assume: Read complete after 0s [id=2229480233]
module.eks.data.aws_iam_policy_document.cluster_autoscaler_assume: Read complete after 0s [id=2339314793]
module.eks.data.aws_iam_policy_document.ebs_csi_driver_assume: Read complete after 0s [id=1458266158]
module.eks.aws_iam_role.aws_load_balancer_controller: Refreshing state... [id=dev-myapp-eks-aws-load-balancer-controller]
module.eks.aws_iam_role.ebs_csi_driver: Refreshing state... [id=dev-myapp-eks-ebs-csi-driver]
module.eks.aws_iam_role.cluster_autoscaler: Refreshing state... [id=dev-myapp-eks-cluster-autoscaler]
module.eks.aws_iam_role_policy_attachment.aws_load_balancer_controller: Refreshing state... [id=dev-myapp-eks-aws-load-balancer-controller-2025102511051540710000000f]
module.eks.aws_iam_role_policy_attachment.ebs_csi_driver_policy: Refreshing state... [id=dev-myapp-eks-ebs-csi-driver-20251025110515465000000010]
module.eks.aws_iam_role_policy_attachment.cluster_autoscaler: Refreshing state... [id=dev-myapp-eks-cluster-autoscaler-2025102511051536020000000e]
module.node_group_spot.aws_iam_role.node_group: Refreshing state... [id=dev-myapp-eks-spot-role]
module.node_group_on_demand.aws_iam_role.node_group: Refreshing state... [id=dev-myapp-eks-on-demand-role]
helm_release.metrics_server: Refreshing state... [id=metrics-server]
module.node_group_spot.aws_security_group.node_group: Refreshing state... [id=sg-05ee49a088d9d915d]
module.node_group_on_demand.aws_security_group.node_group: Refreshing state... [id=sg-084c01217c1b0d1fb]
module.node_group_spot.aws_security_group_rule.node_ingress_self: Refreshing state... [id=sgrule-4258751901]
module.node_group_spot.aws_security_group_rule.node_ingress_cluster: Refreshing state... [id=sgrule-791397801]
module.node_group_spot.aws_security_group_rule.node_ingress_cluster_https: Refreshing state... [id=sgrule-3783379129]
module.node_group_on_demand.aws_security_group_rule.node_ingress_cluster_https: Refreshing state... [id=sgrule-2028984579]
module.node_group_on_demand.aws_security_group_rule.node_ingress_self: Refreshing state... [id=sgrule-3700163888]
module.node_group_on_demand.aws_security_group_rule.node_ingress_cluster: Refreshing state... [id=sgrule-506581433]
module.node_group_on_demand.aws_iam_role_policy_attachment.container_registry_policy: Refreshing state... [id=dev-myapp-eks-on-demand-role-20251025115957891000000008]
module.node_group_on_demand.aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=dev-myapp-eks-on-demand-role-20251025115957798400000005]
module.node_group_on_demand.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=dev-myapp-eks-on-demand-role-20251025115957954500000009]
module.node_group_on_demand.aws_iam_role_policy_attachment.node_group_policy: Refreshing state... [id=dev-myapp-eks-on-demand-role-20251025115957844300000006]
module.node_group_spot.aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=dev-myapp-eks-spot-role-20251025115957767900000003]
module.node_group_spot.aws_iam_role_policy_attachment.container_registry_policy: Refreshing state... [id=dev-myapp-eks-spot-role-20251025115957796800000004]
module.node_group_spot.aws_iam_role_policy_attachment.node_group_policy: Refreshing state... [id=dev-myapp-eks-spot-role-20251025115957641500000001]
module.node_group_spot.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=dev-myapp-eks-spot-role-20251025115957689200000002]
module.node_group_on_demand.aws_eks_node_group.main: Refreshing state... [id=dev-myapp-eks:dev-myapp-eks-on-demand]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.6.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "dev-myapp-eks"
        }
      + set {
          + name  = "region"
          + value = "us-east-1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = "arn:aws:iam::274601145879:role/dev-myapp-eks-aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-0d1708eadb32a47ff"
        }
    }

  # helm_release.cluster_autoscaler will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.29.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "dev-myapp-eks"
        }
      + set {
          + name  = "awsRegion"
          + value = "us-east-1"
        }
      + set {
          + name  = "extraArgs.balance-similar-node-groups"
          + value = "true"
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-system-pods"
          + value = "false"
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = "arn:aws:iam::274601145879:role/dev-myapp-eks-cluster-autoscaler"
        }
    }

  # helm_release.metrics_server is tainted, so must be replaced
-/+ resource "helm_release" "metrics_server" {
      ~ id                         = "metrics-server" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "0.6.4"
              - chart          = "metrics-server"
              - first_deployed = 1761396306
              - last_deployed  = 1761396306
              - name           = "metrics-server"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    ***********************************************************************
                    * Metrics Server                                                      *
                    ***********************************************************************
                      Chart version: 3.11.0
                      App version:   0.6.4
                      Image tag:     registry.k8s.io/metrics-server/metrics-server:v0.6.4
                    ***********************************************************************
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - args = [
                          - "--kubelet-insecure-tls",
                        ]
                    }
                )
              - version        = "3.11.0"
            },
        ] -> (known after apply)
        name                       = "metrics-server"
      ~ status                     = "pending-install" -> "deployed"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.node_group_on_demand.aws_eks_node_group.main is tainted, so must be replaced
+/- resource "aws_eks_node_group" "main" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:274601145879:nodegroup/dev-myapp-eks/dev-myapp-eks-on-demand/d6cd0d9e-af45-06d3-03bd-499fa172f448" -> (known after apply)
      ~ id                     = "dev-myapp-eks:dev-myapp-eks-on-demand" -> (known after apply)
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.28.15-20251016" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = []
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Environment"                             = "dev"
            "ManagedBy"                               = "Terraform"
            "Name"                                    = "dev-myapp-eks-on-demand"
            "Owner"                                   = "DevOps Team"
            "Project"                                 = "myapp"
            "k8s.io/cluster-autoscaler/dev-myapp-eks" = "owned"
            "k8s.io/cluster-autoscaler/enabled"       = "true"
        }
        # (10 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.node_group_spot.aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-myapp-eks"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
          + "t3a.medium",
          + "t3.large",
        ]
      + labels                 = {
          + "capacity-type" = "spot"
          + "environment"   = "dev"
          + "node-group"    = "dev-myapp-eks-spot"
          + "role"          = "worker"
        }
      + node_group_name        = "dev-myapp-eks-spot"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::274601145879:role/dev-myapp-eks-spot-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-01ab54e5c70e60853",
          + "subnet-039e770d58e472805",
          + "subnet-08869537e813e2700",
        ]
      + tags                   = {
          + "Environment"                             = "dev"
          + "ManagedBy"                               = "Terraform"
          + "Name"                                    = "dev-myapp-eks-spot"
          + "Owner"                                   = "DevOps Team"
          + "Project"                                 = "myapp"
          + "k8s.io/cluster-autoscaler/dev-myapp-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "true"
        }
      + tags_all               = {
          + "Environment"                             = "dev"
          + "ManagedBy"                               = "Terraform"
          + "Name"                                    = "dev-myapp-eks-spot"
          + "Owner"                                   = "DevOps Team"
          + "Project"                                 = "myapp"
          + "k8s.io/cluster-autoscaler/dev-myapp-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "true"
        }
      + version                = "1.28"

      + scaling_config {
          + desired_size = 2
          + max_size     = 10
          + min_size     = 0
        }

      + taint {
          + effect = "NO_SCHEDULE"
          + key    = "spot"
          + value  = "true"
        }

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + on_demand_node_group_id   = (known after apply)
  + spot_node_group_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```



*Environment: dev*
*Pusher: @prashant4875, Action: `pull_request`*